import { Injectable } from '@angular/core';
import { Http } from '@angular/http';
import 'rxjs/add/operator/map';

@Injectable()
export class PostsProvider {
    Posts = [
        {
            title: 'مكرونة مخبوزة باللحمة والجبنة', image: 'مكرونة-مخبوزة-باللحمة-والجبنة.png',
            ingredients: {
                'مكرونة ريجينا فيوزيللي': 'كيس',
                'صلصة طماطم ريجينا': '2 كوب',
                'جوز هند': '400 جم',
                'بسلة': '1 كوب',
                'ثمرة بروكلي': '1 كوب',
                'جبنة مبشورة': '¼ كوب',
                'لحمة': '¼ كيلو'
            },
            prepare: [
                'فتحي شواية الفرن وسوي اللحمة على الجانبين لمدة 4 دقائق ثم قطعيها وهي باردة.',
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'إسلقي جوز الهند في مياه مغلية ثم ضيفي البسلة والبروكلي على جوز الهند لمدة دقيقة أو حتى يذبل.',
                'سخني الفرن على درجة حرارة 180 درجة مئوية وضعي الدجاج والمكرونة وخليط جوز الهند وصلصة الطماطم في وعاء كبير وضعيه في الفرن. قلبي المكونات كل دقيقة ثم ضعي الجبنة المبشورة على الخليط وإتركي الوعاء في الفرن لمدة 10 دقائق وتقدم.'
            ],
            tags: {
                time: '45',
                main: 'لحوم',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'مكرونة باللحمة المفرومة الحارة', image: 'مكرونة-باللحمة-المفرومة-الحارة.png',
            ingredients: {
                'مكرونة ريجينا إسباجيتي': 'كيس',
                'صلصة طماطم ريجينا': '2 معلقة',
                'بصل مفروم': '1 ثمرة',
                'لحمة مفرومة': '500 جم',
                'طماطم': '4 ثمرة',
                'بهارات': '',
                'ملح': '',
                'فلفل': '',
                'كمون': '',
                'كسبرة ناشفة': '',
                'قرنفل': '',
                'زنجبيل': '',
                'قرفة': '',
                'شطة': '',
                'زيت': ''
            },
            prepare: [
                'إسلقي مكرونة ريجينا كما هو موضح على الكيس.',
                'في مقلاة، ضعي البصل في القليل من الزيت حتى يصفر.',
                'ضيفي اللحم المفروم وقلبيه حتى يتشرب مياهه ثم ضيفي البهارات والصلصة والطماطم وقلبي حتى تتسبك. ضعي الخليط على المكرونة ويقدم.'
            ],
            tags: {
                time: '15',
                main: 'لحوم',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'شوربة المكرونة باللحمة المفرومة على الطريقة الإيطالية', image: 'شوربة-المكرونة-باللحمة-المفرومة-على-الطريقة-الإيطالية.png',
            ingredients: {
                'مكرونة ريجينا إسباجيتي مقسومة قطع صغيرة': 'كيس',
                'صلصة طماطم ريجينا': '430 جم',
                'كرفس مقطعة قطع صغيرة': '2 سيقان',
                'فلفل أحمر مقطعة قطع صغيرة': '1 ثمرة',
                'بروكلي مقطع قطع صغيرة': '200 جم',
                'لحمة مفرومة': '500 جم',
                'بصل مقطعة': '1 ثمرة'
            },
            prepare: [
                'شكلي اللحمة المفرومة على شكل دوائر.',
                'سخني مقلاة وحمري اللحمة المفرومة فيها لمدة 4 دقائق أو حتى يصبح لونها بني ثم إنقليها في طبق. ضيفي البصل والكرفس في المقلاة وقلبيهم لمدة 4 دقائق. ثم ضيفي الفلفل والصلصة واللحمة المفرومة ونصف كوب مياه باردة على البصل وإتركي الخليط يغلي على نار متوسطة وقلبيهم حتى تستوي اللحمة المفرومة.',
                'ضيفي المكرونة والبروكلي على الخليط وقلبيهم لمدة 5 دقائق أو حتى يتم تسوية المكرونة ثم تقدم.'
            ],
            tags: {
                time: '30',
                main: 'لحوم',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },

        {
            title: 'صينية مكرونة بالسبانخ والدجاج', image: 'صينية-مكرونة-بالسبانخ-والدجاج.png',
            ingredients: {
                'مكرونة ريجينا فرن': 'كيس',
                'سبانخ مفروم': '2 كوب',
                'سمن كبيرة': '3 معلقة',
                'بصل مفروم': '1 كوب',
                'ثوم مفروم': '1 معلقة',
                'دجاج مسلوق مقطع': '4 قطع',
                'جبن شيدر مبشور': '½ كوب',
                'ملح': '',
                'فلفل': '',
                'فلفل أبيض': '',
                'دقيق': '3 ملاعق',
                'زبدة': '3 ملاعق',
                'حليب': '1 ½ كوب',
                'ماء': '1 كوب',
                'جبن موتزاريلا مبشور': '½ كوب'
            },
            prepare: [
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'حضري إناء وقومي بتحمير البصل والثوم في السمن ثم ضيفي إليهم الدجاج والسبانخ، وقلبيه حتى يجف الخليط ثم ضعي الملح والفلفل.',
                'ضعي الدقيق والزبدة على نار هادئة لمدة 2 دقيقة في إناء آخر ثم ضيفي الماء والحليب وقلبيهم على النار حتى تتجانس وتتماسك. ضعي الملح والفلفل الأبيض ثم إرفعيه من على النار ثم ضيفي الجبنة.',
                'ضعي نصف كمية المكرونة في صينية بايركس مدهونة ثم خليط السبانخ ثم البشاميل ثم الكمية المتبقية من المكرونة ثم وزعي الجبن المبشور على السطح.',
                'ضعيها في فرن متوسط الحرارة حتى يحمر وجهه، وتقطع وهي باردة نسبياً.'
            ],
            tags: {
                time: '45',
                main: 'دجاج',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'مكرونة فارفالي بالدجاج', image: 'مكرونة-فارفالي-بالدجاج.png',
            ingredients: {
                'مكرونة ريجينا فارفالي': 'كيس',
                'صدور دجاج مقطعة قطع صغيرة': '½ كيلو',
                'فلفل أصفر مقطعة شرائح': '1 ثمرة',
                'بصل مقطعة شرائح': '1 ثمرة',
                'طماطم مقطعة مكعبات': '6 ثمرة',
                'لبن خالي الدسم': '½ كوب',
                'جبن رومي مبشور': '½ كوب',
                'جبنة بارميزان مبشورة': '2 ملعقة كبيرة',
                'كزبرة خضرة مفرومة': '2 ملعقة كبيرة'
            },
            prepare: [
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'شوحي الدجاج في مقلاة لمدة 4 دقائق حتى يصبح لونها ذهبي.',
                'ضيفي الفلفل الأصفر والبصل وقلبيهم على نار عالية لمدة 3 دقائق ثم ضيفي اللبن والطماطم وإتركي الخليط يغلي على نار منخفضة لمدة 5 دقائق.',
                'ضعي المكرونة في طبق التقديم ثم ضيفي الدجاج والجبنة المبشورة والكزبرة الخضراء للتزيين.'
            ],
            tags: {
                time: '15',
                main: 'دجاج',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'مكرونة ترياكي', image: 'مكرونة-ترياكي.png',
            ingredients: {
                'مكرونة ريجينا إسباجيتي': 'كيس',
                'جزر مبشورة': '1 ثمرة',
                'فلفل ألوان مقطع طولي': '2',
                'كرنب مقطع طولي': '250 جم',
                'بصل مقطعة شرائح': '2 ثمرة',
                'صدور دجاج مقطعة مكعبات': '3',
                'زبدة': '30 جم',
                'زيت': '2 ملعقة',
                'صويا صوص': 'ملعقة',
                'ملح': '',
                'فلفل': ''
            },
            prepare: [
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'حمري البصل في الزيت ثم ضيفي الدجاج وقلبيه، ثم القليل من صويا الصوص واتركيه حتى ينضج. ضيفي عليه الكرنب وقلبيه، مع التقليب ضيفي الفلفل ثم الجزر.',
                'ضيفي القليل من صوص الصويا ثم الزبدة وقلبيه، بعد ذلك ضيفي المكرونة وزبدة مرة أخرى وقلبيه، وتقدم.'
            ],
            tags: {
                time: '30',
                main: 'دجاج',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },

        {
            title: 'سلطة المكرونة بالسالمون', image: 'سلطة-المكرونة-بالسالمون.png',
            ingredients: {
                'مكرونة ريجينا فرن': 'كيس',
                'بروكلي': '2 ثمرة',
                ' جزر مقطعة': '2 ثمرة',
                'زيت زيتون': '1 كوب',
                'صوص الصويا': '2 ملعقة صغيرة',
                'خل': '3 ملاعق كبيرة',
                'ثوم مفروم': '2 فص',
                'عصير ليمون': '3 ملاعق كبيرة',
                'سالمون': '1 علبة',
                'ملح': '',
                'فلفل': ''
            },
            prepare: [
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'إسلقي البروكلي والجزر في مياه مغلية لمدة دقيقتان.',
                'إخلطي زيت الزيتون وصوص الصويا والخل وعصير الليمون والثوم والملح والفلفل مع بعض في طبق وقلبيهم جيداً. (دريسنج السلطة)',
                'ضعي المكرونة والسالمون والخضروات والدريسنج في طبق ويقدم. (يمكنك حفظه في الثلاجة لمدة 4 أيام)'
            ],
            tags: {
                time: '15',
                main: 'مأكولات بحرية',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'فيتوتشيني بالجمبري والمشروم', image: 'فيتوتشيني-بالجمبري-والمشروم.png',
            ingredients: {
                'مكرونة ريجينا فيتوتشيني': 'كيس',
                'جمبري مقشر': '½ كيلو',
                'مشروم مقطع': '',
                'بصل شرائح': '1',
                'ثوم مفروم': '6 فصوص',
                'فلفل أخضر وأحمر مقطع': '',
                'شرائح طماطم': '',
                'ملح': '',
                'فلفل': '',
                'كمون': '',
                'بقدونس': '',
                'شبت': ''
            },
            prepare: [
                'إسلقي المكرونة كما هو موضح على كيس ريجينا.',
                'ضعي ملعقتين كبيرتين زيت علي النار حتى يسخن، ثم ضيفي البصل حتي يصفر لونه ثم ضعي الثوم.',
                'أضيفي الجمبري وقلبيه واتركي الخليط لمدة 5 دقائق حتي يشرب ماء الجمبري ثم ضيفي الفلفل الأحمر والأخضر وقلبيهم.',
                'أضيفي المشروم مع التقليب.',
                'أضيفي شرائح الطماطم ثم الملح والفلفل الأسود والكمون وأخيراً البقدونس والشبت و يترك لمدة 5 دقائق على النار ثم ضيفي نصف الكمية إلى المكرونة المسلوقة ويترك النصف الآخر لتجميل الطبق.'
            ],
            tags: {
                time: '30',
                main: 'مأكولات بحرية',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        },
        {
            title: 'مكرونة بالجمبري والليمون', image: 'مكرونة-جمبري-بالليمون.png',
            ingredients: {
                'مكرونة ريجينا لسان عصفور': 'كيس',
                'ثوم مفروم': '6 فصوص',
                'عصير ليمون': '2 ملعقة',
                'زيت زيتون': '5 ملاعق كبيرة',
                'فلفل أحمر مطحون': '1 ملعقة كبيرة',
                'جمبري متوسط الحجم': '½ كيلو',
                'زبدة': '2 ملعقة كبيرة',
                'بقدونس مفرومة': '1 حزمة',
                'ملح': '',
                'فلفل أسود مطحون': '',
                'كمون': '',
                'بقدونس': '',
                'شبت': ''
            },
            prepare: [
                'تبلي الجمبري بخلطة من الثوم وعصير الليمون وزيت الزيتون والفلفل الأحمر والملح والفلفل الأسود في طبق وإتركيه نصف ساعة ليتبل.',
                'لعمل مرقة الجمبري ضيفي قشر الجمبري مع البصل في حلة صغيرة على نار متوسطة حتى الغليان ثم إنقليه على نار هادئة لمدة دقيقتان ثم صفي مرقة الجمبري من قشر الجمبري والبصل.',
                'إسلقي المكرونة كما هو موضح على كيس ريجينا ثم صفيها من الماء وإحتفظي بنصف كوب من ماء السلق.',
                'إبدئي بطهو الجمبري المتبل لمدة 3 دقائق حتى يصبح لونه وردي.',
                'ضيفي مرقة الجمبري ومياه السلق وخليط الليمون والزبدة والبقدونس على الجمبري وإتركيهم حتى الغليان.',
                'ضعي المكرونة وعليها خليط الجمبري في طبق وتقدم.'
            ],
            tags: {
                time: '45',
                main: 'مأكولات بحرية',
                event: ''
            },
            isFavorite: false,
            addToShoppingList: false
        }
    ];

    /**
     * @param {Http} http
     */
    constructor(public http: Http) {
    }

    get() {
        return this.Posts;
    }

    favorites() {
        return this.Posts.filter((Post) => {
            return Post.isFavorite;
        })
    }

    shopping() {
        return this.Posts.filter((Post) => {
            return Post.addToShoppingList;
        }).map((post) => {
            return this.ingredients(post);
        });
    }

    search(tags) {
        return this.Posts.filter((Post) => {
            let result = false;

            if (tags.add === undefined && tags.time === undefined && tags.event === undefined)
                result = true;

            if (tags.add !== undefined) result = (Post.tags.main.indexOf(tags.add) > -1);
            if (tags.time !== undefined) result = (Post.tags.time.indexOf(tags.time) > -1);
            if (tags.event !== undefined) result = (Post.tags.event.indexOf(tags.event) > -1);

            return result;
        });
    }

    ingredients(post) {
        let ingredients = new Array();

        for (var value in post.ingredients)
            ingredients.push(value);

        return ingredients;
    }

    ingredientsKey(post) {
        let ingredients = new Array();

        for (var value in post.ingredients)
            ingredients.push(value);

        return ingredients;
    }

    prepare(post) {
        return Array.from(post.prepare);
    }
}
